<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <title>Base de Conocimiento: HTML y CSS</title>
    <link rel="stylesheet" href="/estilos/normalize.css" />
    <link rel="stylesheet" href="/estilos/articulos.css" />
  </head>
  <body>
    <header class="container-header">
      <div class="container-header__box">
        <h1 class="container-header__title">Base de Conocimiento</h1>
        <a class="container-header__enlace" href="/index.html">Inicio</a>
      </div>
    </header>
    <main class="container-main">
      <article>
        <h2 class="container-main__title">HTML y CSS</h2>
        <span class="container-main__topic">
          Fundamentos del Desarrollador Web
        </span>
        <p class="container-main__text container-main__text--margin-bottom">
          Existen tres est&aacute;ndares importantes para generar productos web.
          Esto son los lenguajes o est&aacute;ndares que entiende todo navegador
          web:
        </p>
        <ul class="container-main__list">
          <li>
            <span class="container-main__text-bold">HTML: </span>
            estructura de los documentos que se visualizan en los navegadores
            (Chrome, Edge, Firefox, Safari, Opera, entre otros).
          </li>
          <li>
            <span class="container-main__text-bold">CSS: </span>
            es el lenguaje con el que se describen estilos a todo el contenido
            previamente etiquetado con HTML.
          </li>
          <li>
            <span class="container-main__text-bold">JavaScript: </span>
            es el lenguaje que se emplea para crear o brindad a las
            p&aacute;ginas web la capacidad de interactuar con el usuaro y los
            recursos asociados a una p&aacute;gina web.
          </li>
        </ul>
        <picture class="container-main__picture">
          <img
            class="container-main__image"
            src="/articulos/html-y-css/imagenes/html-css-javascript.png"
            alt="Ejemplo-de-terminal"
          />
        </picture>
        <span class="container-main__topic">¿Qu&eacute; es el Frontend?</span>
        <p class="container-main__text container-main__text--margin-bottom">
          Frontend es la parte de un programa o dispositivo a la que un usuario
          puede acceder directamente. Son todas las tecnolog&iacute;as de
          dise&ntilde;o y desarrollo que corren en el navegador y que se
          encargan de la interactividad con los usuarios.
        </p>
        <p class="container-main__text">
          Un programador Frontend debe saber de c&oacute;digo que entienda el
          navegador (HTML, CSS y JavaScript) para poder usar algunos frameworks
          o librer&iacute;as que expanden sus capacidades para crear cualquier
          tipo de interfaces de usuarios.
        </p>
        <p class="container-main__subtopic container-main__subtopic--bold">
          Herramientas que maneja un desarrollador frontend
        </p>
        <p class="container-main__subtopic">
          Debido a que un frontend es el desarrollador que va a manejar las
          cosas del lado del cliente, las tecnolog&iacute;as con las que va a
          trabajar son:
        </p>
        <ul class="container-main__list">
          <li>
            HTML:
            <a href="https://devdocs.io/html/">https://devdocs.io/html/</a>
          </li>
          <li>
            CSS:
            <a href="https://devdocs.io/css/">https://devdocs.io/css/</a>
          </li>
          <li>
            JavaScript:
            <a href="https://devdocs.io/javascript/">
              https://devdocs.io/javascript/
            </a>
          </li>
        </ul>
        <p class="container-main__subtopic">Frameworks de CSS para fronted:</p>
        <ul class="container-main__list">
          <li>
            Bootstrap:
            <a href="https://getbootstrap.com/">https://getbootstrap.com/</a>
          </li>
          <li>
            Foundation CSS:
            <a href="https://get.foundation/">https://get.foundation/</a>
          </li>
          <li>
            Materialize CSS:
            <a href="https://materializecss.com/"
              >https://materializecss.com/</a
            >
          </li>
        </ul>
        <p class="container-main__subtopic">
          Frameworks de JavaScript para frontend:
        </p>
        <ul class="container-main__list">
          <li>
            React JS:
            <a href="https://es.reactjs.org/">https://es.reactjs.org/</a>
          </li>
          <li>
            Angular JS:
            <a href="https://angular.io/">https://angular.io/</a>
          </li>
          <li>
            Vue JS:
            <a href="https://vuejs.org/">https://vuejs.org/</a>
          </li>
        </ul>
        <p class="container-main__subtopic">Preprocesadores de CSS:</p>
        <ul class="container-main__list">
          <li>
            Stylus:
            <a href="https://stylus-lang.com/">https://stylus-lang.com/</a>
          </li>
          <li>
            SASS:
            <a href="https://sass-lang.com/">https://sass-lang.com/</a>
          </li>
        </ul>
        <p class="container-main__subtopic">
          Compiladores / empaquetadores de JS:
        </p>
        <ul class="container-main__list">
          <li>
            BABEL:
            <a href="https://babeljs.io/">https://babeljs.io/</a>
          </li>
          <li>
            Webpack:
            <a href="https://webpack.js.org/">https://webpack.js.org/</a>
          </li>
        </ul>
        <span class="container-main__topic">¿Qu&eacute; es Backend?</span>
        <p class="container-main__text">
          Backend en programaci&oacute;n corresponde al lado opuesto a un
          Front-end en un sitio web o aplicación, ya que el Backend trabaja en
          el lado del servidor. Es el responsable de manejar toda la
          l&oacute;gica que hay detr&aacute;s de una petici&oacute;n dada por el
          navegador hacia el servidor.
        </p>
        <p class="container-main__subtopic">
          Una carecter&iacute;stica que lo diferencia del Frontend es que no
          tiene est&aacute;ndares, puesto que tiene varios lenguajes de
          programaci&oacute;n (Node.js, Python, PHP, Ruby, GO, Java, .NET entre
          otros) con los que debe trabajar. Cada uno de estos lenguajes tiene su
          propios frameworks como:
        </p>
        <ul class="container-main__list">
          <li>Django (Python)</li>
          <li>Laravel (PHP)</li>
          <li>Rails (Ruby)</li>
          <li>Express (JavaScript)</li>
          <li>Spring (Java)</li>
        </ul>
        <p class="container-main__subtopic">
          El Backend tambi&eacute;n tiene en cuenta la infraestructura donde va
          a realizar el deploy de su aplicaci&oacute;n (esto tambi&eacute;n
          puede ser tarea de un DevOps, un perfil dedicado a la
          infraestructura), con tecnolog&iacute;as como:
        </p>
        <ul class="container-main__list">
          <li>Google Cloud</li>
          <li>DigitalOcena</li>
          <li>AWS</li>
          <li>Heroku, entre otras.</li>
        </ul>
        <p class="container-main__subtopic container-main__subtopic--bold">
          ¿Qu&eacute; es deploy?
        </p>
        <p class="container-main__subtopic">
          Deploy es un t&eacute;rmino famoso entre los desarrolladores web.
          Puede significar muchas cosas, dependiendo del ambiente y de la
          tecnolog&iacute;a usada. Sin embargo, los significados que más se
          refieren a la pr&aacute;ctica y pueden resumir su funci&oacute;n son:
          implantar, colocar en posici&oacute;n, habilitar para uso o,
          simplemente, publicar.
        </p>
        <p class="container-main__subtopic">
          Por &uacute;ltimo, entramos en base de datos, que son las encargadas
          de almacenar toda la informaci&oacute;n del proyecto Los principales
          tipos son:
        </p>
        <ul class="container-main__list">
          <li>Bases de datos relacionales (como MySQL)</li>
          <li>Base de datos no relacionales (como mongoDB)</li>
        </ul>
        <span class="container-main__topic">¿Qu&eacute; es Full Stack?</span>
        <p class="container-main__text container-main__text--margin-bottom">
          Full Stack es un t&eacute;rmino utilizado para describir a los
          desarrolladores que conocen tanto los lenguajes de frontend como de
          backend. Principalmente, el desarrollador full stack se refiere al uso
          de JavaScript en el backend y de HTML/CSS/JavaScript en el frontend
          para crear nuevas plataformas.
        </p>
        <p class="container-main__text">
          El nacimiento de tecnolog&iacute;as que funcionan entre el frontend y
          el backend ha dado lugar a la proliferaci&oacute;n de frameworks y
          herramientas de desarrollo full stack, que permiten a los
          desarrolladores construir sus propias aplicaciones web completas
          empleando un &uacute;nico lenguaje de programaci&oacute;n, como Django
          para Python.
        </p>
        <p class="container-main__subtopic container-main__subtopic--bold">
          ¿Qu&eacute; es un desarrollador Full Stack?
        </p>
        <p class="container-main__text container-main__text--margin-bottom">
          Las y los desarrolladores Full Stack son profesionales que se encargan
          tanto de la parte visual y de la interaccion de un sitio (frontend),
          como de su l&oacute;gica y funcionamiento del lado del servidor
          (backend).
        </p>
        <p class="container-main__text">
          Un Stack (en ingl&eacute;s: pila o mont&oacute;n) se refiere al grupo
          de tecnolog&iacute;as que componene un sitio web en todos los aspectos
          (desde la base de datos, hacia el manejo l&oacute;gico y la interfaz
          visual). Una o un desarrolador Full Stack en teor&iacute;a es capaz de
          manejar la pila completa de un sitio, tanto de frontend como de
          backend, además saber utilizar su base de datos.
        </p>
        <p class="container-main__subtopic container-main__subtopic--bold">
          ¿Qu&eacute; hace un desarrollador Full Stack?
        </p>
        <p class="container-main__text container-main__text--margin-bottom">
          Una desarrolladora o desarrollador Full Stack entiende muy bien
          c&oacute;mo funciona un producto web de principio a fin, desde su
          dise&ntilde;o en mockup y deploy hasta producci&oacute;n.
        </p>
        <p class="container-main__text">
          Este tipo de programador o programadora no maneja por completo todas
          las tecnolog&iacute;as de ambas partes, pues cada una requiere
          conocimiento profundo. De hecho, no es recomendado profundizar en
          tantas especialidades y no es sano. El desarrollo web evoluciona muy
          r&aacute;pido y cada dos o tres meses aparecer&aacute; algo nuevo.
        </p>
        <p class="container-main__subtopic container-main__subtopic--bold">
          ¿C&oacute;mo ser un desarrollador Full Stack?
        </p>
        <p class="container-main__text container-main__text--margin-bottom">
          Para convertirse en Full Stack developer se debe dominar las dos
          &aacute;reas b&aacute;sicas: backend y frontend. Esto ayudar&aacute; a
          comprender c&oacute;mo funciona cada uno y a generar una
          comunicaci&oacute;n entre s&iacute;. La mayor&iacute;a de la
          interacci&oacute;n entre estos dos mundos se basa en consumo de API y
          comprender c&oacute;mo consumir una API desde el Frontend
          ayudar&aacute; a entender c&oacute;mo construir una API desde el
          Backend.
        </p>
        <p class="container-main__text">
          Adem&aacute;s, aprender las diferentes formas de subir en internet una
          aplicaci&oacute;n web ayudar&aacute; a entender las diferentes
          estrategias de deploy que existen y permitir&aacute; ampliar los
          conocimientos en el mundo del desarrollo web.
        </p>
        <p class="container-main__subtopic container-main__subtopic--bold">
          Tecnolog&iacute;as Full Stack para desarrolladores
        </p>
        <p class="container-main__subtopic">
          Aprender un stack conocido puede ayudar a dar los primeros pasos como
          desarrollador Full Stack y a escalar un proyecto a producci&oacute;n
          de una manera m&aacute;s r&aacute;pida y con una mayor
          interacci&oacute;n.
        </p>
        <ul class="container-main__list">
          <li>LAMP (Linux, Apache, MySQK, PHP)<br /></li>
          <li>MERN (MongoDB, Express.js, React, Node)<br /></li>
          <li>PERN (PostgreSQL, Express.js, React, Node)<br /></li>
        </ul>
        <span class="container-main__topic">
          P&aacute;ginas Est&aacute;ticas vs. Din&aacute;micas
        </span>
        <p class="container-main__text">
          Los sitios web se comportan de forma diferente dependiendo de la forma
          en que fueron diseñados desde su concepci&oacute;n, tomando en cuenta
          la interacci&oacute;n con el usuario. Aqu&iacute; veremos las
          diferencias entre sitios web est&aacute;ticos y din&aacute;micos:
        </p>
      </article>
    </main>
    <!-- <footer class="container-footer">
      <div class="container-footer__box">
        <a
          class="container-footer__enlace"
          href="https://github.com/codepalacios"
        >
          Desarrollado por codepalacios
        </a>
      </div>
    </footer> -->
  </body>
</html>
