<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>
<body>
    <!-- Cosas que debes saber en el mundo del Desarrollo Web -->
    <h1>Web Developer Fundamentals</h1>
    <p>
        Existen tres est&aacute;ndares importantes para generar productos web. 
        Esto son los lenguajes o est&aacute;ndares que entiende todo navegador 
        web: 
    </p>
    <ul>
        <li>
            HTML: estructura de los documentos que se visualizan en los 
            navegadores (Chrome, Edge, Firefox, Safari, Opera, entre otros).
        </li>
        <li>
            CSS: es el lenguaje con el que le damos estilos a todo el contenido 
            previamente etiquetado con HTML.
        </li>
        <li>
            JavaScript: es el lenguaje que se emplea para crear o brindad a las 
            p&aacute;ginas web la capacidad de interactuar con el usuaro y los 
            recursos asociados a una p&aacute;gina web.
        </li>
    </ul>
    <h3>¿Qu&eacute; es el Frontend?</h3>
    <p>
        <b>Frontend</b> es la parte de un programa o dispositivo a la que un 
        usuario puede acceder directamente. Son todas las tecnolog&iacute;as de 
        dise&nacute;o y desarrollo eb que corren en el navegador y que se 
        encargan de la interactividad con los usuarios.<br><br>
        Un <b>programador Frontend</b> debe saber de c&oacute;digo que entienda 
        el navegador (HTML, CSS y JavaScript) para poder usar algunos 
        <i>frameworks</i> o librer&iacute;as que expanden sus capacidades para 
        crear cualquier tipo de interfaces de usuraios.
    </p>
    <h4>Herramientas que maneja un frontend</h4>
    <p>
        Debido a que un frontend es el desarrollador que va a manejar las cosas 
        del lado del cliente, las tecnolog&iacute;as con las que va a trabajar 
        son:
    </p>
    <ul>
        <li>
            HTML: 
            <a href="https://devdocs.io/html/">https://devdocs.io/html/</a>
        </li>
        <li>
            CSS: 
            <a href="https://devdocs.io/html/">https://devdocs.io/html/</a>
        </li>
        <li>
            JavaScript: 
            <a href="https://devdocs.io/javascript/">
                https://devdocs.io/javascript/
            </a>
        </li>
    </ul>
    <p>Frameworks de CSS para fronted:</p>
    <ul>
        <li>
            Bootstrap: 
            <a href="https://getbootstrap.com/">https://getbootstrap.com/</a>
        </li>
        <li>
            Foundation CSS: 
            <a href="https://get.foundation/">https://get.foundation/</a>
        </li>
        <li>
            Materialize CSS: 
            <a href="https://materializecss.com/">https://materializecss.com/</a>
        </li>
    </ul>
    <p>Frameworks de JavaScript para frontend:</p>
    <ul>
        <li>
            React JS: 
            <a href="https://es.reactjs.org/">https://es.reactjs.org/</a>
        </li>
        <li>
            Angular JS: 
            <a href="https://angular.io/">https://angular.io/</a>
        </li>
        <li>
            Vue JS:
            <a href="https://vuejs.org/">https://vuejs.org/</a>
        </li>
    </ul>
    <p>Preprocesadores de CSS:</p>
    <ul>
        <li>
            Stylus:
            <a href="https://stylus-lang.com/">https://stylus-lang.com/</a>
        </li>
        <li>
            SASS:
            <a href="https://sass-lang.com/">https://sass-lang.com/</a>
        </li>
    </ul>
    <p>Compiladores / empaquetadores de JS:</p>
    <ul>
        <li>
            BABEL: 
            <a href="https://babeljs.io/">https://babeljs.io/</a>
        </li>
        <li>
            Webpack: 
            <a href="https://webpack.js.org/">https://webpack.js.org/</a>
        </li>
    </ul>
    <h3>¿Qu&eacute; es Backend?</h3>
    <p>
        <b>Backend</b> en programaci&oacute;n corresponde al <i>lado opuesto</i> 
        a un Front-end en un sitio web o aplicación, ya que el Backend trabaja 
        en el lado del cliente. Es el responsable de <b>manejar toda la 
        l&oacute;gica</b> que hay detr&aacute;s de una petici&oacute;n dad por 
        el navegador hacia el servidor. <br><br>
        Una carecter&iacute;stica que lo diferencia del Frontend es que no tiene 
        est&aacute;ndares, puesto que tiene varios lenguajes de 
        programaci&oacute;n (Node.js, Python, PHP, Ruby, GO, Java, .NET entre 
        otros) con los que debe trabajar. Cada uno de estos lenguajes tiene 
        su propios frameworks como:
    </p>
    <ul>
        <li>Django (Python)</li>
        <li>Laravel (PHP)</li>
        <li>Rails (Ruby)</li>
        <li>Express (JavaScript)</li>
        <li>Spring (Java)</li>
    </ul>
    <p>
        El Backend tambi&eacute;n tiene en cuenta la infraestructura donde va a 
        realizar el deploy de su aplicaci&oacute;n (esto tambi&eacute;n puede 
        ser tarea de un DevOps, un perfil dedicado a la infraestructura), con 
        tecnolog&iacute;as como:
    </p>
    <ul>
        <li>Google Cloud</li>
        <li>DigitalOcena</li>
        <li>AWS</li>
        <li>Heroku, entre otras.</li>
    </ul>
    <h4>Qu&eacute; es deploy?</h4>
    <p>
        Deploy es yb t&eacute;rmino famoso entre los desarrolladores web. Puede 
        significar muchas cosas, dependiendo del ambiente y de la tecnolog&iacute;a 
        usada. Sin embargo, los significados que más se refieren a la pr&aacute;ctica 
        y pueden resumir su funci&oacute;n son: implantar, colocar en posici&oacute;n 
        habilitar para uso o, simplemente, publicar.<br><br>
        Por &uacute;ltimo, entramos en <b>base de datos</b>, que son las encargadas 
        de almacenar toda la informaci&oacute;n del proyecto Los principales tipos 
        son: 
    </p>
    <ul>
        <li>Bases de datos relacionales (como MySQL)</li>
        <li>Base de datos no relacionales (como mongoDB)</li>
    </ul>
</body>
</html>