<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Base de Conocimiento</title>
</head>
<body>
    <header>
        <h1>HTML y CSS</h1>
    </header>
    <nav>
        <a href="../index.html">Base de Conocimiento</a>
    </nav>
    <article>
       <section>
        <h3>¿Qu&eacute; son y para qu&eacute; nos sirven HTML y CSS?</h3>
        <p>
            HTML <u>Lenguaje de Marcado de Hipertexto</u> es el c&oacute;digo que te ayuda a <u>estructurar</u> una p&aacute;gina web (el esqueleto) y 
            CSS <u>Hoja de Estilo en Cascada</u> es el lenguaje que le da <u>vida</u> al sitio web (agregando colores, tamaños, ubicaciones y más).
        </p>
        <img src="https://tidomundo.com.br/wp-content/uploads/2022/04/imagem-4.png" alt="Ejemplo HTML, CSS y JS">
        <h3>Motores de rederizado</h3>
        <p>
            La funci&oacute;n principal es pasar de archivos a p&iacute;xeles en pantalla. Los navegadores tienen motores y todos ellos b&aacute;sicamente 
            hacen lo mismo para pasar los archivos a p&iacute;xeles.
        </p>
        <table border="1">
            <tr>
                <th>Navegador</th>
                <th>Motor</th>
            </tr>
            <tr>
                <td>Chrome</td>
                <td>Blink</td>
            </tr>
            <tr>
                <td>Edge</td>
                <td>Edge HTML</td>
            </tr>
            <tr>
                <td>Safari</td>
                <td>Webkit</td>
            </tr>
            <tr>
                <td>Firefox</td>
                <td>Gecko</td>
            </tr>
        </table>
        <p>
            El navergador hace 5 pasos:
        </p>
        <ol>
            <li>Pasa los archivos a objetos (DOM)</li>
            <li>Calcula el estilo correspondiente a cada nodo DOM</li>
            <li>Calcula las dimensiones de cada nodo y d&oacute;nde va en la pantalla</li>
            <li>Pinta las diferentes cajas</li>
            <li>Toma las capas y las convierte en una imagen para mostrar en pantalla</li>
        </ol>
        <h3>Anatom&iacute;a de un elemento HTML</h3>
        <h4>Elemento y Atributos</h4>
        <p>
            Un elemento HTML est&aacute; compuesto por una etiqueta de apertura, el contenido y una etiqueta de cierre. Adicionalmente puede contener uno o 
            más atributos que ayudan a modificar el comportamiento del elemento.
        </p>
        <img src="https://i0.wp.com/www.irinadelgado.com/wp-content/uploads/2020/04/etiquetas-y-atributos-hmtl-2.png?resize=677%2C381&ssl=1" alt="Ejemplo elemento y atributos en HTML">
        <h4>Anidamiento</h4>
        <p>
            Las etiquetas <u>anidadas</u> son aquellas que se encuentran entre la instrucción de inicio y la instrucción de fin de otra etiqueta. De 
            esta forma conseguimos que los efectos de ambas se sumen. En otras palablas <u>anidar</u> una <u>etiqueta</u> es lo mismo que meterla dentro 
            de otra.
        </p>
        <img src="https://www.ibiblio.org/pub/Linux/docs/LuCaS/Manuales-LuCAS/doc-curso-html/doc-curso-html/img/fig6-20.png" alt="Ejemplo anidar HTML">
        <h4>Elementos vac&iacute;os</h4>
        <p>
            Un elemento vac&iacute;o es un <u>elemento HTML que no puede tener nodos secundarios</u> (es decir, elementos anidados o nodos de texto).
        </p>
        <img src="https://schoolsofweb.com/wp-content/uploads/Anatomy-of-an-html-empty-tag.jpg" alt="Ejemplo elemento vacio HTML">
        <h3>Anatom&iacute;a de un documento HTML</h3>
        <p>
            La estructura b&aacute;sica de una p&aacute;gina web se compone por las etiquetas <b>&#60;html>, &#60;head> y &#60;body></b>. La primera 
            indica el comienzo de la p&aacute;gina; la segunda es la cabera y contiene informaci&oacute;n descriptiva del sitio; y la tercera es la que 
            contiene todos los elementos visibles dentro de una p&aacute;gina.
        </p>
        <img src="https://disenowebakus.net/imagenes/articulos/estructura-basica-de-una-pagina-web-en-html.jpg" alt="Ejemplo estructura HTML" />
        <h3>¿Qu&eacute; es HTML sem&aacute;ntico?</h3>
        <p>
            HTML sem&aacute;ntico es el uso de <u>etiquetas con significado</u> que ayudan a tu sitio a ser accesible, mejorar tu posicionamiento SEO 
            (Posicionamiento en Buscadores) y tener un c&oacute;digo m&aacute;s claro.
        </p>
        <img src="https://www.arkaitzgarro.com/html5/images/cap02/html5.png" alt="Ejemplo HTML semantico">
        <h3>Etiquetas de HTML m&aacute;s usadas</h3>
        <table border="1">
            <tr>
                <th>Layout</th>
                <th>Textos</th>
                <th>Im&aacute;genes y video</th>
                <th>Formilarios</th>
                <th>Listas</th>
                <th>Enlaces</th>
            </tr>
            <tr>
                <td>header</td>
                <td>h1...h6</td>
                <td>img</td>
                <td>form</td>
                <td>li</td>
                <td>a</td>
            </tr>
            <tr>
                <td>nabvar</td>
                <td>p</td>
                <td>svg</td>
                <td>input</td>
                <td>ol</td>
                <td></td>
            </tr>
            <tr>
                <td>section</td>
                <td>span</td>
                <td>iframe</td>
                <td>label</td>
                <td>li</td>
                <td></td>
            </tr>
            <tr>
                <td>article</td>
                <td></td>
                <td>video</td>
                <td>button</td>
                <td></td>
                <td></td>
            </tr>
            <tr>
                <td>aside</td>
                <td></td>
                <td></td>
                <td></td>
                <td></td>
                <td></td>
            </tr>
            <tr>
                <td>footer</td>
                <td></td>
                <td></td>
                <td></td>
                <td></td>
                <td></td>
            </tr>
            <tr>
                <td>div</td>
                <td></td>
                <td></td>
                <td></td>
                <td></td>
                <td></td>
            </tr>
        </table>
        <h3>Anatom&iacute;a de una declaraci&oacute;n CSS</h3>
        <p>
            Una declaraci&oacute;n CSS est&aacute; compuesta por selector, propiedad y valor.
        </p>
        <img src="https://2.bp.blogspot.com/-yrZT99X6IMQ/Unhyj7P1SMI/AAAAAAAAASg/3yB4EREBbUk/s1600/regla_css.png" alt="Ejemplo declaracion CSS">
        <h4>Tipos de selectores: b&aacute;sicos y combinadores.</h4>
        <p>
            Los <u>selectores</u> definene sobre qu&eacute; elementos se aplicar&aacute; un conjunto de reglas CSS.
        </p>
        <table border="1">
            <tr>
                <th colspan="2">Selectores B&aacute;sicos</th>
            </tr>
            <tr>
                <th>De tipo</th>
                <td>div {...}</td>
            </tr>
            <tr>
                <th>De clase</th>
                <td>.elemento {...}</td>
            </tr>
            <tr>
                <th>De id</th>
                <td>#id-del-elemento</td>
            </tr>
            <tr>
                <th>De atributo</th>
                <td>a[href="..."] {...}</td>
            </tr>
            <tr>
                <th>Universal</th>
                <td>* {...}</td>
            </tr>
        </table><br>
        <table border="1">
            <tr>
                <th colspan="2">Selectores Combinadores</th>
            </tr>
            <tr>
                <th>Descendientes</th>
                <td>div p</td>
            </tr>
            <tr>
                <th>Hijo directo</th>
                <td>div > p</td>
            </tr>
            <tr>
                <th>Elemento adyacente</th>
                <td>div + p</td>
            </tr>
            <tr>
                <th>General de hermanos</th>
                <td>div ~ p</td>
            </tr>
        </table>
        <h4>Tipos de selectores: pseudoclases y pseudoelementos.</h4>
        <p>
            Las pseudoclases permiten llegar a las actividades o acciones que 
            realiza el usuario, por ejemplo: darle clic a un bot&oacute;n, pasar el mouse 
            sobre una imagen, bot&oacute;n o texto; para poder extilizarlo. Los pseudoelementos 
            permiten acceder a los elementos de HTML que no son accesibles por otros selectores, 
            por ejemplo: la primera letra de un texto, agregar contenido antes o depu&eacute;s 
            de un texto, entre otros; para poder estilizarlo. Ambos se diferencian por que las 
            pseudoclases se escriben con dos puntos y los pseudoelementos con dobles dos puntos.
        </p>
        <table border="1">
            <tr>
                <th>Pseudoclases</th>
                <th>Pseudoelementos</th>
            </tr>
            <tr>
                <td>:active</td>
                <td>::after</td>
            </tr>
            <tr>
                <td>:focus</td>
                <td>::before</td>
            </tr>
            <tr>
                <td>:hover</td>
                <td>::first-letter</td>
            </tr>
            <tr>
                <td>:nth-child(n)</td>
                <td>::placeholder</td>
            </tr>
        </table>
        <h3>Cascada y especificidad en CSS</h3>
        <p>
            <u>Hojas de Estilo en Cascada (del ingl&eacute;s Cascading Style Sheets) o CSS</u> es el lenguaje de estilos utilizado para describir la 
            presentaci&oacute;n de documentos HTML. <u>Cascada</u> significa que el orden de las reglas en CSS, importa. Los navegadores determinan 
            que reglas de CSS deben aplicarse a las etiquetas HTML. El orden y el origen de clasificaci&oacute;n del CSS, intervienen en el proceso. 
            Sin embargo, no todo es color de rosa. A veces los navegadores entran en conflicto porque no saben que regla aplicar. 
            <u>La especificidad de los selectores</u> es la manera que tiene CSS de lidiar con los conflictos. Entre mayor especificidad, mayor va a 
            ser la probabilidad de que sus declaraciones se usen sobre las dem&aacute;s.
        </p>
        <table border="1">
            <tr>
                <th>Jerarqu&iacute;a de la especificidad de CSS</th>
            </tr>
            <tr>
                <td>!important</td>
            </tr>
            <tr>
                <td>Estilos en l&iacute;nea</td>
            </tr>
            <tr>
                <td>#id</td>
            </tr>
            <tr>
                <td>Clases, atributos y pseudoclases</td>
            </tr>
            <tr>
                <td>Elementos y pseudoelementos</td>
            </tr>
            <tr>
                <td>Selector universal</td>
            </tr>
        </table>
        <h3>Tipos de display m&aacute;s usados</h3>
        <p>
            <u>Display</u> es el tipo de visualizaci&oacute;n (el tipo de cuadro de representaci&oacute;n) que tienen los elementos.
        </p>
        <ul>
            <li>Block: muestra un elemento como un elemento de bloque (como &#60;p>). Comienza en una nueva l&iacute;nea y ocupa todo el ancho.</li>
            <li>Inline: muestra un elemento como un elemento en l&iacute;nea (como &#60;span>). Cualquier propiedad de alto y ancho no tendr&aacute; efecto.</li>
            <li>Inline-block: muestra un elemento como un contenedor de bloques de nivel en l&iacute;nea. El elemento en s&iacute; est&aacute; formateado 
                como un elemento en l&iacute;nea, pero puede aplicar valores de alto y ancho.
            </li>
            <li>Flex: muestra un elemento como un contenedor flexible a nivel de bloque.</li>
            <li>Grid: muestra un elemento como un contenedor de cuadr&iacute;cula a nivel de bloque.</li>
        </ul>
        <h3>Modelo de caja</h3>
        <p>
            Todo en CSS tiene una caja alrededor, y comprender estas cajas es clave para poder crear diseños con CSS o para alinear elementos con otros 
            elementos. En CSS, en general, hay dos tipos de cajas: <u>cajas en bloque</u> y <u>cajas en l&iacute;nea</u>. El modelo de cajas CSS completo 
            se aplica a cajas que representan comportamiento en bloque; las cajas con comportamiento en l&iacute;nea solo usan una parte del comportamiento 
            definido en el modelo de cajas. El modelo define c&oacute;mo funcionan juntas las diferentes partes de una caja (margen, border, relleno y 
            contenido) para crear una caja que puedas ver en tu p&aacute;gina.
        </p>
        <img src="https://miro.medium.com/max/382/1*LYIt459KOTM4R-uQFHg_bw.png" alt="Ejemplo modelo caja CSS">
       </section>
    </article>
    <aside>
        <h3><u>Enlaces complementearios</u></h3>
        <a href="https://www.espai.es/blog/2018/01/que-es-el-html-semantico/">Qu&eacute; es HTML sem&aacute;ntico y cu&aacute;les son sus ventajas</a><br>
        <a href="https://htmlreference.io/">HTML Reference - A free guide to all HTML elements and attributes</a><br>
        <a href="https://htmlcolorcodes.com/es/">C&oacute;digos de Colores HTML</a><br>
        <a href="https://developer.mozilla.org/es/docs/Learn/CSS/Building_blocks/Selectors/Pseudo-classes_and_pseudo-elements">Pseudoclases y pseudoelementos</a><br>
        <a href="https://developer.mozilla.org/es/docs/Web/CSS/Specificity">Especificidad - CSS - MDN Web Docs</a><br>
        <a href="https://specificity.keegan.st">Specificity Calculator</a><br>
        <a href="https://www.w3schools.com/cssref/pr_class_display.asp">CSS display property - W3Schools</a><br>
        <a href="https://css-tricks.com/snippets/css/a-guide-to-flexbox/">A Complete Guide to Flexbox | CSS-Tricks</a><br>
        <a href="https://css-tricks.com/snippets/css/complete-guide-grid/">A Complete Guide to Grid | CSS-Stricks</a><br>
        <a href="https://developer.mozilla.org/es/docs/Learn/CSS/Building_blocks/The_box_model">El modelo de caja - Aprende sobre desarrollo web | MDN</a><br>
        <a href="https://www.joshwcomeau.com/css/rules-of-margin-collapse/">The Rules of Margin Collapse</a><br>
        <a href="https://learn-the-web.algonquindesign.ca/topics/flexbox/">Flexbox · Web Dev Topics · Learn the Web</a>
    </aside>
    <footer>
        Base de Conocimiento - 26/07/2022
    </footer>
</body>
</html>