<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="robots" content="index, follow" />
    <meta
      name="description"
      content="Proyecto recopilatorio de diversos apuntes sobre programación"
    />
    <title>JavaScript</title>
    <link rel="stylesheet" href="/estilos/normalize.css" />
    <link rel="stylesheet" href="/estilos/articulos.css" />
    <link
      rel="stylesheet"
      href="/estilos/articulos-laptop.css"
      media="screen and (min-width: 1280px)"
    />
    <link
      rel="stylesheet"
      href="/estilos/articulos-laptop-l.css"
      media="screen and (min-width: 1600px)"
    />
  </head>

  <body>
    <header class="container-header">
      <div class="container-header__box">
        <h1 class="container-header__title">Base de Conocimiento</h1>
        <a class="container-header__enlace" href="/index.html">Inicio</a>
      </div>
    </header>
    <main class="container-main">
      <article>
        <h2 class="container-main__title">JavaScript</h2>
        <span class="container-main__topic">
          Introducci&oacute;n a JavaScript
        </span>
        <p class="container-main__text container-main__text--bold">
          ¿Qu&eacute; es JavaScript?
        </p>
        <p class="container-main__text container-main__text--top-bottom">
          JavaScript es un lenguaje de programaci&oacute;n din&aacute;mico que
          tiene la capacidad de ser utilizado en muchos dispositivos diferentes.
          Puede usarse en ordenadores personales, servidores web y
          tel&eacute;fonos intelegintes. Es un lenguaje interpretado, orientado
          a objetos, débilmente tipado y din&aacute;mico.
        </p>
        <p class="container-main__text container-main__text--bottom">
          JavaScript se emplea com&uacute;nmente para el desarrollo web
          front-end y m&aacute;s recientemente para algunos desarrollos back-end
          a trav&eacute;s de frameworks como Node.js o Next.js. Tiene
          caracter&iacute;sticas como la programaci&oacute;n orientada a
          objetos, funciones y herencia basada en prototipos.
        </p>
        <p class="container-main__text container-main__text--bold">
          ¿C&oacute;mo nace JavaScript?
        </p>
        <p class="container-main__text container-main__text--top-bottom">
          Nace con la necesidad de generar dinamismo en las p&aacute;ginas web y
          que a su vez tanto los usuarios como las empresas pudieran interactuar
          unos con otros. Fue creado por Brendan Eich en 1995 y se convirtio en
          un est&aacute;ndar oficial del World Wide Web Consortium (W3C) en
          1997.
        </p>
        <p class="container-main__text container-main__text--bold">
          ¿Por qu&eacute; JavaScript es un lenguaje din&aacute;mico?
        </p>
        <p class="container-main__text container-main__text--top-bottom">
          JavaScript corre directamente en la etapa de Runtime, sin una etapa de
          compilaci&oacute;n previa. Esto permite probar el c&oacute;digo
          inmediatamente; pero tambi&eacute;n es lo que hace que los errores no
          se muestren sino hasta que se ejecuta el programa. Lo que se ve a
          primera vista, cuando se analiza el c&oacute;digo, es muy probable que
          no sea lo que se va a obtener cuando el programa se ejecute.
        </p>
        <p class="container-main__text container-main__text--top-bottom">
          JavaScript permite declarar (por ejemplo) variables cuyo valor (y
          tipo) solo se conocer&aacute; al momento de su ejecuci&oacute;n en
          funci&oacute;n de las condiciones dadas al momento de correrlo en un
          entorno real. En cambio, los lenguajes est&aacute;ticos no
          compilar&aacute;n en c&oacute;digo ejecutable a menos que todos los
          valores (o tipos de valores) se conozcan por adelantado.
        </p>
        <p class="container-main__text container-main__text--bold">
          ¿Por qu&eacute; JavaScript es d&eacute;bilemente tipado?
        </p>
        <p class="container-main__text container-main__text--top-bottom">
          Por que los tipos de datos no est&aacute;n bien definidos en el
          lenguaje y permite, por ejemplo, operaciones entre n&uacute;meros y
          letras. Esto sucede porque el lenguaje asume tipos de datos que no
          necesariamente fueron los que se quer&iacute;an representar. Se pueden
          hacer operaciones entre tipos distintos de datos (enteros con strings,
          booleanos con enteros, etc.). Ejemplo:
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="/articulos/javascript/imagenes/tipado-js-laptop-l.png"
          />
          <source
            media="(min-width:1280px)"
            srcset="/articulos/javascript/imagenes/tipado-js-laptop.png"
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/tipado-js.png"
            alt="tipado-javascript"
          />
        </picture>
        <p class="container-main__text container-main__text--bold">
          ¿Es JavaScript un lenguaje interpretado?
        </p>
        <p class="container-main__text container-main__text--top-bottom">
          S&iacute;, y la raz&oacute;n es que el navegador lee l&iacute;nea por
          l&iacute;nea el c&oacute;digo, el cual indica lo que tiene que ir
          haciendo, sin la necesidad de compilar. Todo esto es controlado por el
          motor de JavaScript V8 del navegador.
        </p>
        <p class="container-main__text container-main__text--bold">
          ¿Qu&eacute; significa que JavaScript es Backwards Compatible?
        </p>
        <p class="container-main__text container-main__text--top-bottom">
          Todas las funciones nuevas que se agregan para JavaScript no
          dañar&aacute;n el trabajo ya hecho previamente, pero no se prodrá
          utilizar en el entorno de trabajo inmediatamente. Para solucionar esto
          est&aacute; Babel, que permite usar las nuevas caracter&iacute;sticas
          del lenguaje, pero lo transforma a una versi&oacute;n que el navegador
          pueda entender.
        </p>
        <p
          class="container-main__text container-main__text--bold container-main__text--bottom"
        >
          ¿Por qu&eacute; JavaScript?
        </p>
        <ol class="container-main__list">
          <li>
            JavaScript tiene una comunidad enorme de desarrolladores que pueden
            ayudar a generar diferentes cosas.
          </li>
          <li>
            Si se desea solo trabajar en aplicaciones web existen muchos
            frameworks y librer&iacute;as contruidas en JavaScript que ayudan a
            hacer proyectos de forma mucho m&aacute;s r&aacute;pida, eficiente y
            robusta (Angular, View, React, entre otros).
          </li>
          <li>
            Si no desea trabajar solo en aplicaciones web se puede utilizar
            JavaScript con un framework que se llama React Native para poder
            construir apliaciones nativas para Android e IOS.
          </li>
          <li>
            Se puede construir aplicaciones de escritorio con JavaScript, usando
            un framework llamado Electron, pueden correr en Mac o Windows.
          </li>
          <li>
            Tambi&eacute;n se puede trabajar en la parte del Back-end o IOT
            (Internet Od Things). Internet de las cosas es un concepto que se
            refiere a una interconexion digital de objetos cotidianos con
            Internet. Esto con un Framework llamado Node.js, el cual es un
            entorno de ejecuci&oacute;n de JavaScript que corre directamente en
            el Back-end.
          </li>
        </ol>
        <p
          class="container-main__text container-main__text--bold container-main__text--top-bottom"
        >
          Tipos de datos en JavaScript
        </p>
        <p class="container-main__text">
          Los elementos que se utilizan en un lenguaje de programaci&oacute;n
          son: data que se guardan en memoria y tareas (funciones) que se
          realizaran con esa data.
        </p>
        <p class="container-main__text container-main__text--top-bottom">
          Tipos primitivos:
        </p>
        <ul class="container-main__list">
          <li>
            <span class="container-main__text container-main__text--bold">
              String:
            </span>
            cadena de texto.
          </li>
          <li>
            <span class="container-main__text container-main__text--bold">
              Number:
            </span>
            valores num&eacute;ricos.
          </li>
          <li>
            <span class="container-main__text container-main__text--bold">
              Boolean:
            </span>
            true &oacute; false.
          </li>
          <li>
            <span class="container-main__text container-main__text--bold">
              Null:
            </span>
            tipo especial, contiene null.
          </li>
          <li>
            <span class="container-main__text container-main__text--bold">
              Undefined:
            </span>
            tipo especial, contiene undefined.
          </li>
        </ul>
        <p class="container-main__text container-main__text--top-bottom">
          Tipos objetos:
        </p>
        <ul class="container-main__list">
          <li>
            <span class="container-main__text container-main__text--bold">
              Tipos predefinidos de JavaScript:
            </span>
            Date (fechas), RegExp (expresiones regulares), Error (datos de
            error).
          </li>
          <li>
            <span class="container-main__text container-main__text--bold">
              Tipos definidos por el programador / usuario:
            </span>
            funciones simples y clases.
          </li>
          <li>
            <span class="container-main__text container-main__text--bold">
              Arrays:
            </span>
            serie de elementos o formaci&oacute;n tipo vector o matriz. Se
            considera un objeto especial que carece de m&eacute;todos.
          </li>
          <li>
            <span class="container-main__text container-main__text--bold">
              Objetos especiales:
            </span>
            objeto global, objeto prototipo, otros.
          </li>
        </ul>
        <p
          class="container-main__text container-main__text--bold container-main__text--top-bottom"
        >
          Operador typeof
        </p>
        <p class="container-main__text">
          El operador typeof devuelve una cadena que indica el tipo de valor o
          dato del operando en JavaScript.
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="/articulos/javascript/imagenes/typeof-laptop-l.png"
          />
          <source
            media="(min-width:1280px)"
            srcset="/articulos/javascript/imagenes/typeof-laptop.png"
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/typeof.png"
            alt="operador-typeof-javascript"
          />
        </picture>
        <p
          class="container-main__text container-main__text--bold container-main__text--bottom"
        >
          ¿Qu&eacute; es una variable en JavaScript?
        </p>
        <p class="container-main__text">
          Una variable puede considerarse como un contenedor donde se puede
          almacenar datos, una vez guardados se pueden acceder a ellos a
          trav&eacute;s del nombre de variable que se haya asignado. Dentro de
          JavaScript existen tres formas de declarar una variable: var, const
          (constante) y let.
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="/articulos/javascript/imagenes/variable-laptop-l.png"
          />
          <source
            media="(min-width:1280px)"
            srcset="/articulos/javascript/imagenes/variable-laptop.png"
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/variable.png"
            alt="variables-en-javascript"
          />
        </picture>
        <p class="container-main__text container-main__text--bottom">
          Buenas pr&aacute;cticas para la declaraci&oacute;n de variables:
        </p>
        <ol class="container-main__list">
          <li>
            El nombre de la variable debe ser un nombre descriptivo que se pueda
            identificar con el c&oacute;digo.
          </li>
          <li>
            Los nombres de variables no se pueden iniciar con n&uacute;meros.
          </li>
          <li>
            No se pueden usar caracteres especiales, ni es recomendable empezar
            una variable el nombre de una variable con may&uacute;scula.
          </li>
          <li>
            Los tipos de escritura de una variable son: lowerCamelCase,
            UpperCamelCase y snake_case.
          </li>
          <li>
            Se debe tener en cuenta que existen nombres que no se pueden
            utilizar porque se encuentran como palabras reservadas para el
            lenguaje.
          </li>
        </ol>
        <p
          class="container-main__text container-main__text--bold container-main__text--top-bottom"
        >
          ¿Qu&eacute; es una funci&oacute;n en JavaScript?
        </p>
        <p class="container-main__text container-main__text--bottom">
          Una funci&oacute;n es un trozo o bloque de c&oacute;digo reutilizable
          en el que hay un conjunto de instrucciones, dicho c&oacute;digo solo
          se ejecuta cuando se llama o invoca dicha funci&oacute;n. Las
          funciones pueden utilizar o no par&aacute;metros, que son los datos
          necesarios que se env&iacute;an al llamar una funci&oacute;n
          seg&uacute;n el caso para la correcta ejecuci&oacute;n del mismo.
        </p>
        <p class="container-main__text">
          Existen dos tipos de funciones: declarativas y expresivas. Las
          funciones declarativas se les declara con la palabra reservada
          function y las funciones expresivas o an&oacute;nimas consisten en
          guardar la funci&oacute;n en una variable. Ambas tienen la misma
          declaraci&oacute;n e invocaci&oacute;n, pero la diferencia consiste en
          no especificar un nombre en la funci&oacute;n expresiva, sino que
          utilizar el nombre de la variable.
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="
              /articulos/javascript/imagenes/funciones-javascript-laptop-l.png
            "
          />
          <source
            media="(min-width:1280px)"
            srcset="
              /articulos/javascript/imagenes/funciones-javascript-laptop.png
            "
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/funciones-javascript.png"
            alt="funciones-en-javascript"
          />
        </picture>
        <span class="container-main__topic container-main__topic--bottom">
          Bases de JavaScript
        </span>
        <p class="container-main__text container-main__text--bold">Scope</p>
        <p class="container-main__text container-main__text--top-bottom">
          El scope es el alcance que una variable tiene en el c&oacute;digo,
          decide a qu&eacute; variables tiene acceso cada parte del
          c&oacute;digo desarrollado. Existen dos tipos de scope, el escope
          global y el scope local.
        </p>
        <p class="container-main__text">
          El scope local permite acceder a una variable &uacute;nicamente en
          cierta parte del c&oacute;digo y la variable es conocida como una
          variable local. Un ejemplo es cuando una variable est&aacute;
          declarada dentro de un bloque o funci&oacute;n y solo puede ser
          invocada por el mismo bloque o funci&oacute;n
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="/articulos/javascript/imagenes/scope-local-laptop-l.png"
          />
          <source
            media="(min-width:1280px)"
            srcset="/articulos/javascript/imagenes/scope-local-laptop.png"
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/scope-local.png"
            alt="scope-local-en-javascript"
          />
        </picture>
        <p class="container-main__text">
          En el scope global la variable est&aacute; declarada fuera de un
          bloque o funci&oacute;n y es conocida como variable global. Puede ser
          accedida desde cualquier parte del c&oacute;digo desarrollado, ya sea
          dentro y fuera de un bloque o funci&oacute;n.
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="/articulos/javascript/imagenes/scope-global-laptop-l.png"
          />
          <source
            media="(min-width:1280px)"
            srcset="/articulos/javascript/imagenes/scope-global-laptop.png"
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/scope-global.png"
            alt="scope-global-en-javascript"
          />
        </picture>
        <p class="container-main__text">
          Las variables declaradas con let o const dentro de un bloque, el
          alcance o scope que tendr&aacute;n ser&aacute; solo dentro de ese
          bloque. Sin embargo, las variables declaradas con var, su valor se
          puede sobreescribir. Motivo por el cual no es recomendable utilizar
          este tipo de variables, ya que puede generar bugs.
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="/articulos/javascript/imagenes/scope-lcv-laptop-l.png"
          />
          <source
            media="(min-width:1280px)"
            srcset="/articulos/javascript/imagenes/scope-lcv-laptop.png"
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/scope-lcv.png"
            alt="let-const-y-var-scope-en-javascript"
          />
        </picture>
        <p class="container-main__text">
          Tambi&eacute;n es importante saber que en el caso se tenga una
          funci&oacute;n dentro de otra, la funci&oacute;n externa no tiene
          acceso a las variables de la funci&oacute;n interna, pero la
          funci&oacute;n interna si tiene acceso a las variables de la
          funci&oacute;n externa.
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="/articulos/javascript/imagenes/scope-funciones-laptop-l.png"
          />
          <source
            media="(min-width:1280px)"
            srcset="/articulos/javascript/imagenes/scope-funciones-laptop.png"
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/scope-funciones.png"
            alt="funciones-y-scope-en-javascript"
          />
        </picture>
        <p class="container-main__text container-main__text--bold">Hoisting</p>
        <p class="container-main__text container-main__text--top-bottom">
          Hoisting es un t&eacute;rmino para describir que las declaraciones de
          variables y funciones son desplazadas a la parte superior del scope
          m&aacute;s cercano, scope global o local. Esto sucede solamente con
          las declaraciones y no con las asignaciones.
        </p>
        <p class="container-main__text container-main__text--bottom">
          El c&oacute;digo permanece igual, solo es una interpretaci&oacute;n
          del motor de JavaScript. En el caso de las variables solamente sucede
          cuando son declaradas con la palabra reservada var. Lo que sucede es
          que las declaraciones de variables y funciones son asignadas en
          memoria durante la fase de compilaci&oacute;n, pero quedan exactamente
          en d&oacute;nde se han escrito en el c&oacute;digo.
        </p>
        <p class="container-main__text">
          Por lo tanto, debido al hoisting se puede utilizar una variable antes
          de declararla:
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="/articulos/javascript/imagenes/hoisting-var-laptop-l.png"
          />
          <source
            media="(min-width:1280px)"
            srcset="/articulos/javascript/imagenes/hoisting-var-laptop.png"
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/hoisting-var.png"
            alt="hoisting-var-en-javascritp"
          />
        </picture>
        <p class="container-main__text">
          Pero lo que en realidad sucede es que gracias al hoisting se eleva la
          declaraci&oacute;n de la variable asign&aacute;ndole un valor
          undefined:
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="
              /articulos/javascript/imagenes/hoisting-var-declaracion-laptop-l.png
            "
          />
          <source
            media="(min-width:1280px)"
            srcset="
              /articulos/javascript/imagenes/hoisting-var-declaracion-laptop.png
            "
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/hoisting-var-declaracion.png"
            alt="hoisting-var-declaracion-en-javascritp"
          />
        </picture>
        <p class="container-main__text">
          Tambi&eacute;n el hoisting permite utilizar una funci&oacute;n sin
          problemas antes de que sea declarada en el c&oacute;digo:
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="
              /articulos/javascript/imagenes/hoisting-funciones-laptop-l.png
            "
          />
          <source
            media="(min-width:1280px)"
            srcset="
              /articulos/javascript/imagenes/hoisting-funciones-laptop.png
            "
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/hoisting-funciones.png"
            alt="hoisting-funciones-en-javascritp"
          />
        </picture>
        <p class="container-main__text">
          Pero es importante recordar que lo que sucede es que JavaScript guarda
          la función en memoria en la fase de creaci&oacute;n de un contexto de
          ejecuci&oacute;n. No asigna un valor undefined como con las variables.
          Tambi&eacute;n se puede primero declara la funci&oacute;n y luego
          llamarla con normalidad.
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="
              /articulos/javascript/imagenes/hoisting-funciones-declaracion-laptop-l.png
            "
          />
          <source
            media="(min-width:1280px)"
            srcset="
              /articulos/javascript/imagenes/hoisting-funciones-declaracion-laptop.png
            "
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/hoisting-funciones-declaracion.png"
            alt="hoisting-funciones-declaracion-normal-en-javascritp"
          />
        </picture>
        <p class="container-main__text container-main__text--bottom">
          El hoisting solo sucede con las declaraciones de variables y
          funciones, por lo que se recomienda declarar las variables y funciones
          lo m&aacute;s arriba posible del c&oacute;digo, ya que se considera
          buena pr&aacute;ctica.
        </p>
        <p class="container-main__text container-main__text--bold">
          Coerci&oacute;n
        </p>
        <p class="container-main__text container-main__text--top-bottom">
          La coerci&oacute;n consiste en transformar de un tipo de dato a otro
          de una variable. Existen dos tipos de coerci&oacute;n:
          impl&iacute;cita y expl&iacute;cita.
        </p>
        <p class="container-main__text">
          La coerci&oacute;n impl&iacute;cita es cuando el lenguaje JavaScript
          ayuda con la transformaci&oacute;n de tipos. Esto ocurre en
          operaciones de diferentes tipos, ya que es un lenguaje d&eacute;bil y
          din&aacute;micamente tipado. Esto implica que el motor de JavaScript
          lo interpreta a su manera y podr&iacute;a arrojar un valor que puede
          ser err&oacute;neo, por lo cual es importante tener cuidado.
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="
              /articulos/javascript/imagenes/coercion-implicita-laptop-l.png
            "
          />
          <source
            media="(min-width:1280px)"
            srcset="
              /articulos/javascript/imagenes/coercion-implicita-laptop.png
            "
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/coercion-implicita.png"
            alt="coercion-implicita-javascritp"
          />
        </picture>
        <p class="container-main__text">
          La coerci&oacute;n expl&iacute;cita es cuando se obliga a que
          transforme un tipo de dato. Para realizar estas transformaciones se
          utilizan funciones como: Number(), String() y Boolean(); parar
          convertir un dato a tipo n&uacute;mero, string y l&oacute;gico
          respectivamente.
        </p>
        <picture class="container-main__picture">
          <source
            media="(min-width:1600px)"
            srcset="
              /articulos/javascript/imagenes/coercion-explicita-laptop-l.png
            "
          />
          <source
            media="(min-width:1280px)"
            srcset="
              /articulos/javascript/imagenes/coercion-explicita-laptop.png
            "
          />
          <img
            class="container-main__image container-main__image--code"
            src="/articulos/javascript/imagenes/coercion-explicita.png"
            alt="coercion-explicita-javascritp"
          />
        </picture>
      </article>
    </main>
    <!-- <footer class="container-footer">
      <div class="container-footer__box">
        <a
          class="container-footer__enlace"
          href="https://github.com/codepalacios"
        >
          Desarrollado por codepalacios
        </a>
      </div><p class="container-main__text container-main__text--bold container-main__text--top-bottom">
        Operador typeof
      </p>
    </footer> -->

    <!-- BASES DE JAVASCRIPT -->
    <!--    Contenido a evaluar para agregarlo
      Coerción
      Es la forma en la que podemos cambiar un tipo de valor a otro, existen dos tipos de coerción.
        1. Coerción implicita: es cuando el lenguaje nos ayuda a cambiar el tipo de valor.
        2. Coerción explicita: es cuando obligamos a que cambi el tipo de valor
      Nota: evaluar agregar ejemplos prácticos de codigo.
       -->
    <!-- Contenido a evaluar para agregalo
      Valores: Truthy y Falsy
      ¿Que tipos por default son verdaderos y falsos?. Todo esto lo vamos a usar en condiciones, esto valida si es verdadero o falso para ejecutar cierta acción.
      Nota: agregar ejemplos prácticos de resultados de valores.
     -->
    <!--  Contenido a evaluar para agregarlo
      Operadores: Asignación, Comparación y Aritméticos.
      En clase práctica mente se hablo de todos los tipos de operadores y sus funcionamios y/o diferencias entre si mismos.
      == // === (tiene que ser igual en valor y tipo)
      https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Expressions_and_Operators
     -->

    <!-- CONDICIONALES -->

    <!-- 
        Condicionales: If, Else, esle if.
      Se hablo sobre como funcionan las condicionales y el operador condicional ternario.
      https://developer.mozilla.org/es/docs/Web/JavaScript/Reference/Operators/Conditional_Operator
      -->
    <!-- 
        Switch
      Se hablo sobre como funciona la estructura condicional switch.
     -->

    <!-- ARRAYS -->
    <!-- 
        Arrays
      Se hablo en clases que es un array, la sintaxis de declaracion, como imprimir sus valores y diferentes metodos para agregar mas elementos al array y eliminarlos. IndexOf para obtener la posición de un elemento. Los arrays pueden tener mas arrays dentro. Lenght.
      -->

    <!-- Loops -->

    <!-- 
      Loops: For y For...of
    Profesor enseño el funcionamiento del loops for y el modificado for...of, ambos con ejemplos de un array de estudiante llamando una function en los loops.
    Nota: agregar ejemplos de codigos mejoraria los aticulos en general.
     -->
    <!-- 
      Loops: While
    Profesor enseño el funcionamiento del loops while con un ejemplo de array estudiantes.
     -->

    <!-- Objects -->

    <!-- 
        Objects
      Explicacion de que es un objeto y como llevar cosas del mundo real a la abstraccion de la programación. Se eseño la sintxis de un objeto, mostro un ejemplo de autor, como añadirle propiedades y funciones (llamadas metodos) para luego llamar esas propiedades y la funcion. POO. Sintaxis en JavaScript. Uso de this en el objeto.  
     -->
    <!-- 
        Objects: Función constructora.
      Explicación de la sintaxis, creación, funcionamiento y utilizacion de un constructor para crear objetos de manera menos manual. Importante dejar en claro el funcionamiento de la palabra reservada New que sirve para crear objetos de un objeto realcionado (?).
     -->

    <!-- Métodos de Arrays -->

    <!-- 
        Métodos de recorridos de Arrays
      Profesor hablo sobre los metodos filter y map para regresar resultados de un array que contiene datos de tipo objetos. Explico la diferencia entre filtrar y mapear.
     -->
    <!-- 
        Recorriendo Arrays con .find(), .forEach() y .some()
      Profesor explica y enseña el uso y uso de los distintos metodos asi como sus diferenfias y que es lo que retornan.
      Nota: estaria bien incluir enlaces a la documentacion oficial.
     -->

    <!-- INICIO DE CURSO PRÁCTICO DE JAVASCRIPT -->

    <!-- 

      PRUEBA DE JAVASCRIPT

        Variables
      Hablo principalmente de las diferencias entre var, let y const. Var ya no se usa por que suele dar algunos problemas aunque es valido ocuparlo, pero altualmente se utiliza let. Const no puede cambiar su valor una vez asignado.
      Aclarando puntos de declarar una variable, inicializarla y reinicializarla.

      Nota: estaria bien detallar las diferencias entre llaves, corchetes y parentesis.

        Condicionales
      Punto importante a considerar: el uso del return en una condicional que este dentro de una función.

        Ciclos
      Punto importante aclarar sobre los ciclos infinitos.

        Arrays y objetos
      Array: es una lista de elementos. Objeto: es una lista de elementos PERO cada elemento tiene un nombre clave.

        Bonus: reducción de condicionales.
      Profesor untilizo un if que si un objeto con el nombre de la propiedad le retornava un valor ese if se ejecutaria.


      MANIPULACION DEL DOM

        Cómo conectar JavaScript con HTML
      El DOM en HTML y etiqueta para vincular javascript. //Mostrar ejemplo con código.
      Tambien se hablo sobre lo que es un entorno de ejecución. Backend y Frontend (NodeJS y el navegador web)

        Leyendo HTML desde JavaScript
      Tenemos funciones o metodos que nos da nuestro entorno de ejecucion (el navegador web en el caso de desarrollo frontend) para seleccionar los elementos que tenemos en el html que esta ejecutando a nuestro código javascritp.
      document.getElementById();
      document.getElementByClassName();
      document.querySelecto();
      document.querySelectorAll(); // Trae en forma de lista todos los elementos
      Nota: incluir ejemplos practicos ya que es importante dejar muy en claro la lecutra HTML desde JavaScript.

        Escribiendo HTML desde JavaScript
      Manipulacion del DOM desde javascritp consiste en editar e incluso crear nuevos elementos para nuestro html utilizando javascript. Tiene sentido que se haga con la intencion de que cuando el usuario haga algo pase algo.
      En clase se vio como cambiar el contenido de un elemento html, obtener o cambiar un atributo, agregar o remover clases, cambiar valores, finalemente crear nuevos elementos.
      innerHTML // Importante tener cuidado por temas de seguridad por que escribe HTML no texto.
      innerText
      classList.add
      classList.remove
      input.value = '123'
      document.createElement(img);

        Eventos en JavaScript: interactuando con usuarios
      Profesor muestra en clase como se ejecutan un console.log en html con onClick u onChange (para inputs evaluando el cambio de su contenido interior). Adional informa que no es la forma correcta en html si no mandar a llamar metodos a javascript. En archivo .js crea las variables respectivas y cada click en un boton por clente (escuchando evento) manda a llamar funcion que retorna una suma. Explica que existen varias formas y no es la unica. Atributos en HTML.
      Nota: reto que deja profesor es transformar un string a entero (Number o parseInt).

        addEventListener
      Lo ideal es que se agrege un escucha perde desde javascript para mantener nuestro codigo HTML y CSS limpio. Esto se logra agregando element.addEventListener('nombreEvento', funcionALlamarSinParentesisAlFinal) en javascript. También se explico el funcionamiento de un formulario que al último boton que tenga le asiga automaticamente type='submit' y que al interactuar con el recarga la pagina modificando la url. Los valores que se ingresaron en el formulario por ende desaparecera y no mostrara la informacion en la misma paginda. Se hablo que para parar el comportamiento por default se pueden hacer dos cosas: primero seria cambiar el button a type='button' o segundo utilizar el objeto event (nota: explicarlo en el contenido a profundidad) enviado a la funcion al a llamar en el escucha para utilizar event.preventDefault(); evitando que se recargue la pagina y luego cambiando la información en los elementos HTML segun necesitemos.
      Nota: validar agregar enlace de referencia a mas elementos o eventos de addEventListener.

      
      CONTRIBUCION A PROYECTOS

        Conectando GitHub a proyectos de JavaScript
      Profesor hablo sobre como conectar un repositorio ya existente a GitHub haciendo enfasis en confirguar primero el archivo .gitinore (gitignore.io, evaluar si contenido seria mejor colocarlo en articulo git). De tal forma ya podriamos contribuir a otros proyectos de javascript.

        Proyectos con JavaScript y GitHub desde cero
      Profersor mostro como hacer un nuevo repositorio y las ventajas que tenemos al siempre iniciar un proyecto de esta manera y como clonarlo a nuestra PC. Se enseña como agregar el archivo .ignore con ciertas configuraciones seleccionadas al igual que una licenca.
      Nota: estaria bien investigar sobre el tema.

        Fork a proyectos en GitHub
      Profesor mostro como hacer fork del proyecto práctico y clonarlo en nuestro PC. Principalmente aclaro lo que es contribuir en un proyecto. No significa que al ver un código con dudosas practicas hablaremos de que todo esta mal hecho. No hay que llegar a imponer, sino a contribuir y para eso hay que enteder como esta el código con el que estan trabajando, su historia, las posibles fallas, lo que esta bien, lo que esta mal y hasta entonces se prodra contribuir en el proyecto.
      Nota: estaria bien validar incluir en el articulo de git y GitHub.

        Analizando código de proyectos open-source.
      Practicamente no tenemos que limitanrnos por que en general no es buena práctica y no es nada profesional. No criticar si no buscar puntos de mejoras.

        Fusión del menú en desktop.
      Profesor comenzo a fucionar clase 11 y clase7. Como punto importante implemento clase inactive con display none para ocultar menu pequeño y luego con javascript escucho evento click para email del menu y de esa manera activar desktopMenu.classList.toggle('inactive'); para quitar y volver a colocar clase a elemento HTML haciendo que menú aparezca y se oculte.

        Fusión del menu en mobile.
      Profesor fusiono el menu mobile y lo configuro con clase inactive.

        Carrito de compras.
      Profesor agrego el aside carrito de compras. Puntos importantes: se agrego color de fondo para que los menus no se superpongan e utilizo menuMobile.classList.contains('inactive'); para validar si un menu estaba abierto y cerrarlo si es estaba abriendo otros (retorana verdadero o faslo);

        Lista de productos: HTML a partir de arrays.
      Profesor agrego el contenedor principar y el contenedor de cards (que tiene en su interior toda la lista de los productos) si envargo no dejo el código ingresado a mano, sino que solo dejo los contenedores principales para luego desde javascript ingresarlos de forma interactiva mediante un recorrido de array (que simula de momento un API REST). En el cual genera el HTML guardandolas en constantes mediante const nameElement = documente.createElement('div'); luego le agrega clases mediante classList. En cuanto a elementos de imagenes hace productImg.setAttribute('src', product.image); para modificar y traer la src de la imagen del objeto de array. Tambien con innerText agrega precio y nombre del producto. Por ultimo agregar de forma ordenada todo el html mediante cardsContainer.appendChild(productCard);. Tambien aclara que lo ideal seria tener un funcion render para traer no solo un listado si no poder traer el que se seleccione de acuerdo a la interaccion que realice el usuario o lo que seleccione. Nota: dificil de incluir estas notas LOL.

        Detalle de un producto.
      Profesor agrego el aside de detalles de un producto. Configuro el css de forma especifica utilizando ids y por ultimo configuro javascritp para los nuevos selectores. Nota: configuraciones practicamente.

        Interacción entre todos los componentes.
      El profesor termino de configurar las interacciones entres los menus para que estos se cierren y no se superpogan. Nota importante: al haber generado elementos HTML desde javascript desde el mismo javascript se le pueden agregar addEventListener() para escuchar sus respectivos eventos que desde HTML no se podrián. Podria ser un buen punto a considerar para agregar al articulo.
      -->
  </body>
</html>
